app/controllers/drinks_controller.rb

  def choose

    if params[:choice_id]
      # If drink is chosen, return json of the drink
      if params[:choice_id] == "0"
        # If no drink is chosen, send back choice_id of zero
        redirect_to root_path
      end
      @drink = Drink.find(params[:choice_id])
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT 1  [["id", 30]]

  def index
    @bar = Bar.find(params[:bar_id])
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", 1]]

  def show
    @drink = Drink.find(params[:id])
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT 1  [["id", 5]]