app/controllers/tags_controller.rb

  def index
    # tag choosing logic
    if !params[:id]
      @tag1 = Tag.find(1)
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]

    @drink_ids = []
    if @next_tags[:children].length === 0
      @drink_choices = []
      @bars_drinks = Drink.all
      @bars_drinks.each do |drink|
        @drink_tags_array = drink.tags.pluck(:id)
---
SELECT "drinks".* FROM "drinks"
SELECT "tags"."id" FROM "tags" INNER JOIN "drinks_tags" ON "tags"."id" = "drinks_tags"."tag_id" WHERE "drinks_tags"."drink_id" = $1  [["drink_id", 1]]